{
  "title": "Asmaul Husna - 99 Names of Allah (Complete Details)",
  "language": "en",
  "count": 99,
  "names": [
    {
      "id": 1,
      "name_ar": "ٱللّٰهُ",
      "name_bn": "Allah",
      "meaning_bn": "The One and Only God, the Supreme Creator",
      "virtues": "‘Allah’ is the root of all divine names; it contains all attributes of perfection and majesty. Remembering this name strengthens faith and focuses the heart.",
      "practices": "1) Begin every action with the name of Allah (Bismillah).\n2) Recite 'La ilaha illallah' regularly in times of hardship and ease.\n3) Teach this name first to children as their earliest spiritual learning."
    },
    {
      "id": 2,
      "name_ar": "الرَّحْمَٰنُ",
      "name_bn": "Ar-Rahman",
      "meaning_bn": "The Most Gracious — His mercy is universal for all creation",
      "virtues": "Ar-Rahman describes Allah’s all-encompassing mercy; every creation—humans, animals, and plants—receives His grace.",
      "practices": "1) Recite this name in Surah Al-Fatihah and other duas.\n2) Show mercy to others in order to reflect Allah’s mercy.\n3) Remember this name and rely on Allah in difficult times."
    },
    {
      "id": 3,
      "name_ar": "الرَّحِيمُ",
      "name_bn": "Ar-Rahim",
      "meaning_bn": "The Most Merciful — especially merciful to the believers",
      "virtues": "Ar-Rahim refers to Allah’s special, intimate mercy reserved for the believers.",
      "practices": "1) Invoke this name in prayers and supplications.\n2) Forgive others to earn Allah's mercy.\n3) Recite this name in tasbeeh at night for tranquility."
    },
    {
      "id": 4,
      "name_ar": "ٱلْمَلِكُ",
      "name_bn": "Al-Malik",
      "meaning_bn": "The Sovereign, the Absolute Owner of all dominion",
      "virtues": "Al-Malik signifies Allah’s supreme authority and ownership of all creation.",
      "practices": "1) Place full trust in Allah before making major decisions.\n2) Submit all affairs to His authority.\n3) Maintain humility even when in positions of power."
    },
    {
      "id": 5,
      "name_ar": "ٱلْقُدُّوسُ",
      "name_bn": "Al-Quddus",
      "meaning_bn": "The Most Pure, Perfect, and Free from all defects",
      "virtues": "Al-Quddus emphasizes Allah’s absolute purity and freedom from any imperfection.",
      "practices": "1) Purify the heart through repentance.\n2) Increase acts of worship to attain spiritual purity.\n3) Maintain cleanliness and purity in daily life."
    },
    {
      "id": 6,
      "name_ar": "ٱلسَّلَامُ",
      "name_bn": "As-Salam",
      "meaning_bn": "The Source of Peace and Safety",
      "virtues": "As-Salam is the giver of peace and security; those who seek refuge in Him are safe.",
      "practices": "1) Spread peace by saying 'Assalamu Alaikum'.\n2) Ask Allah for peace and safety in dua.\n3) Recite this name for inner tranquility."
    },
    {
      "id": 7,
      "name_ar": "ٱلْمُؤْمِنُ",
      "name_bn": "Al-Mu’min",
      "meaning_bn": "The Giver of security and faith",
      "virtues": "Al-Mu’min provides safety, reassurance, and certainty to His servants.",
      "practices": "1) Seek protection from Allah in times of fear.\n2) Help others feel safe and supported.\n3) Strengthen faith through regular recitation."
    },
    {
      "id": 8,
      "name_ar": "ٱلْمُهَيْمِنُ",
      "name_bn": "Al-Muhaymin",
      "meaning_bn": "The Protector, Overseer and Guardian",
      "virtues": "Al-Muhaymin watches over all things, knowing the seen and unseen.",
      "practices": "1) Express gratitude each morning for Allah’s protection.\n2) Trust every aspect of life to Allah’s care.\n3) Be patient in difficulties while relying on His protection."
    },
    {
      "id": 9,
      "name_ar": "ٱلْعَزِيزُ",
      "name_bn": "Al-Aziz",
      "meaning_bn": "The Almighty, the All-Powerful",
      "virtues": "Al-Aziz possesses absolute power and honor; He grants strength to whom He wills.",
      "practices": "1) Seek Allah’s help in times of weakness.\n2) Remain humble despite strength or success.\n3) Stand against injustice with His support."
    },
    {
      "id": 10,
      "name_ar": "ٱلْجَبَّارُ",
      "name_bn": "Al-Jabbar",
      "meaning_bn": "The Compeller, the One who mends the broken",
      "virtues": "Al-Jabbar fixes what is broken and enforces His will with unmatched power.",
      "practices": "1) Ask Allah to heal emotional pain and brokenness.\n2) Support justice in society.\n3) Seek strength from Allah during personal weaknesses."
    },
    {
      "id": 11,
      "name_ar": "ٱلْمُتَكَبِّرُ",
      "name_bn": "Al-Mutakabbir",
      "meaning_bn": "The Supreme in Greatness and Majesty",
      "virtues": "Allah alone possesses true greatness; humans must avoid arrogance.",
      "practices": "1) Practice humility.\n2) Thank Allah for His majesty.\n3) Attribute success to Allah’s blessings."
    },
    {
      "id": 12,
      "name_ar": "ٱلْخَالِقُ",
      "name_bn": "Al-Khaliq",
      "meaning_bn": "The Creator of all things",
      "virtues": "Al-Khaliq creates everything with perfection and purpose.",
      "practices": "1) Appreciate the beauty of creation.\n2) Work to protect the environment.\n3) Seek Allah’s help when beginning new tasks."
    },
    {
      "id": 13,
      "name_ar": "ٱلْبَارِئُ",
      "name_bn": "Al-Bari’",
      "meaning_bn": "The Evolver, the One who fashions creation in perfect order",
      "virtues": "Al-Bari’ designs every creature with precision.",
      "practices": "1) Reflect on creation to increase gratitude.\n2) Organize and beautify your own work.\n3) Seek inspiration from Allah in creativity."
    },
    {
      "id": 14,
      "name_ar": "ٱلْمُصَوِّرُ",
      "name_bn": "Al-Musawwir",
      "meaning_bn": "The Fashioner, the Bestower of forms",
      "virtues": "Al-Musawwir designs each being with unique form and beauty.",
      "practices": "1) Appreciate diversity in creation.\n2) Maintain permissible boundaries in art.\n3) Remember Allah’s grace in your own physical form."
    },
    {
      "id": 15,
      "name_ar": "ٱلْغَفَّارُ",
      "name_bn": "Al-Ghaffar",
      "meaning_bn": "The Most Forgiving — repeatedly forgiving",
      "virtues": "Al-Ghaffar forgives endlessly; the doors of repentance are always open.",
      "practices": "1) Perform sincere repentance.\n2) Forgive others.\n3) Recite this name at night seeking forgiveness."
    },
    {
      "id": 16,
      "name_ar": "ٱلْقَهَّارُ",
      "name_bn": "Al-Qahhar",
      "meaning_bn": "The Dominant One, who has total control over all",
      "virtues": "Al-Qahhar overcomes all obstacles; rely on Him in hardship.",
      "practices": "1) Ask for Allah’s help during trials.\n2) Stay humble when given authority.\n3) Seek His support in eradicating injustice."
    },
    {
      "id": 17,
      "name_ar": "ٱلْوَهَّابُ",
      "name_bn": "Al-Wahhab",
      "meaning_bn": "The Giver of Gifts, the Bestower",
      "virtues": "Al-Wahhab gives generously without limit.",
      "practices": "1) Ask Allah for sustenance, knowledge, and wisdom.\n2) Share blessings with the needy.\n3) Practice generosity in daily life."
    },
    {
      "id": 18,
      "name_ar": "ٱلْرَّزَّاقُ",
      "name_bn": "Ar-Razzaq",
      "meaning_bn": "The Provider, the Sustainer",
      "virtues": "Ar-Razzaq provides sustenance to whom He wills in unlimited ways.",
      "practices": "1) Work hard while trusting Allah for rizq.\n2) Give charity often.\n3) Remain patient during financial difficulties."
    },
    {
      "id": 19,
      "name_ar": "ٱلْفَتَّاحُ",
      "name_bn": "Al-Fattah",
      "meaning_bn": "The Opener of doors, the Granter of success",
      "virtues": "Al-Fattah opens doors of opportunity and resolves difficulties.",
      "practices": "1) Ask Allah before starting difficult tasks.\n2) Invoke this name for success in exams or business.\n3) Maintain taqwa to receive Allah’s openings."
    },
    {
      "id": 20,
      "name_ar": "ٱلْعَلِیُّ",
      "name_bn": "Al-Aliyy",
      "meaning_bn": "The Most High, the Exalted",
      "virtues": "Al-Aliyy represents Allah’s supreme height and greatness.",
      "practices": "1) Set goals with sincerity and humility.\n2) Work with noble intentions.\n3) Reflect Allah’s greatness by staying humble."
    },
    {
      "id": 21,
      "name_ar": "ٱلْكَبِيرُ",
      "name_bn": "Al-Kabir",
      "meaning_bn": "The Most Great, infinitely majestic",
      "virtues": "Al-Kabir’s greatness encompasses everything.",
      "practices": "1) Express gratitude for Allah’s greatness.\n2) Avoid overreacting to small issues—be patient."
    },
    {
      "id": 22,
      "name_ar": "ٱلْحَفِيظُ",
      "name_bn": "Al-Hafiz",
      "meaning_bn": "The Preserver, the Protector",
      "virtues": "Al-Hafiz protects all creation and guards from harm.",
      "practices": "1) Ask for His protection at night.\n2) Protect valuable relationships and blessings.\n3) Recite this name before travel."
    },
    {
      "id": 23,
      "name_ar": "ٱلْمُقيِتُ",
      "name_bn": "Al-Muqit",
      "meaning_bn": "The Nourisher, the Sustainer of all needs",
      "virtues": "Al-Muqit provides the necessities of life and controls sustenance.",
      "practices": "1) Express gratitude every morning for provision.\n2) Work with effort while praying for barakah."
    },
    {
      "id": 24,
      "name_ar": "ٱلْحَسِيبُ",
      "name_bn": "Al-Hasib",
      "meaning_bn": "The Reckoner, the One who takes full account",
      "virtues": "Al-Hasib monitors all actions—good and evil.",
      "practices": "1) Hold yourself accountable for your deeds.\n2) Strive for a purified lifestyle."
    },
    {
      "id": 25,
      "name_ar": "ٱلْجَلِيلُ",
      "name_bn": "Al-Jalil",
      "meaning_bn": "The Majestic, the Exalted One",
      "virtues": "Al-Jalil possesses absolute majesty and honor.",
      "practices": "1) Reflect on Allah’s majestic attributes.\n2) Maintain humility before His greatness."
    },
    {
      "id": 26,
      "name_ar": "ٱلْكَرِيمُ",
      "name_bn": "Al-Karim",
      "meaning_bn": "The Most Generous, the Benevolent",
      "virtues": "Al-Karim grants blessings even without being asked.",
      "practices": "1) Increase charity and kindness.\n2) Show gratitude for Allah’s favors."
    },
    {
      "id": 27,
      "name_ar": "ٱلْرَّقِيبُ",
      "name_bn": "Ar-Raqib",
      "meaning_bn": "The Watchful, the All-Observing",
      "virtues": "Ar-Raqib watches over every action and intention.",
      "practices": "1) Be mindful in both public and private behavior.\n2) Maintain fairness and honesty."
    },
    {
      "id": 28,
      "name_ar": "ٱلْمُجِيبُ",
      "name_bn": "Al-Mujib",
      "meaning_bn": "The Answerer, the Responsive",
      "virtues": "Al-Mujib responds to prayers and needs.",
      "practices": "1) Make dua sincerely and patiently.\n2) Ask Allah for help during emotional or personal needs.\n3) Thank Allah when duas are granted."
    },
    {
      "id": 29,
      "name_ar": "ٱلْوَاسِعُ",
      "name_bn": "Al-Wasi‘",
      "meaning_bn": "The All-Encompassing, whose mercy and bounty are infinite",
      "virtues": "Al-Wasi‘ reflects Allah’s vast mercy and limitless generosity.",
      "practices": "1) Trust His vast mercy during hardship.\n2) Be generous and open-hearted toward others."
    },
    {
      "id": 30,
      "name_ar": "ٱلْحَكِيمُ",
      "name_bn": "Al-Hakim",
      "meaning_bn": "The All-Wise and Most Judicious",
      "virtues": "Al-Hakim’s wisdom governs every decree with justice and perfection.",
      "practices": "1) Trust Allah’s decisions even when not understood.\n2) Seek wisdom in life through Quran and Sunnah."
    },
  {
    "id": 31,
    "name_ar": "ٱلْعَلِيمُ",
    "name_bn": "Al-Aleem",
    "meaning_bn": "The All-Knowing",
    "virtues": "Allah possesses perfect and complete knowledge. Nothing in the heavens or the earth is hidden from Him—whether it is an action, intention, emotion, secret, or even a thought that forms in the heart. His knowledge is eternal, not gained or learned, and He knows the consequences of all events before they occur. Understanding Allah as Al-Aleem gives a believer confidence that every event in life has divine wisdom, even if not immediately understood.",
    "practices": [
      "Before making any major life decision—marriage, job, business—ask Allah for guidance (Istikhara), trusting that His knowledge is complete while ours is limited.",
      "Seek beneficial knowledge in dunya (skills, education) and deen (Quran, Sunnah) because Allah loves the seekers of knowledge.",
      "Remain sincere and avoid sinning privately because Allah knows the unseen and nothing is hidden from His sight.",
      "Reflect on the Quran regularly, as it is revealed by Al-Aleem and contains divine perfect guidance."
    ]
  },
  {
    "id": 32,
    "name_ar": "ٱلْقَابِضُ",
    "name_bn": "Al-Qabid",
    "meaning_bn": "The Withholder",
    "virtues": "Allah withholds sustenance, happiness, strength, or opportunities for reasons rooted in wisdom. Sometimes He restricts provision to protect the believer, redirect them to something better, purify sins, soften the heart, or test patience. When Allah withholds, it is never out of cruelty but out of mercy and perfect judgment. Recognizing Allah as Al-Qabid brings peace during hardships and prevents despair.",
    "practices": [
      "Remain patient during financial hardship, loss, or emotional difficulty—reminding yourself that Allah is testing and purifying you.",
      "Reflect on your life and repent sincerely, as times of restriction often signal a call from Allah to return to Him.",
      "During moments of tightness, increase dhikr (Astaghfirullah) and dua, believing that Allah will soon expand your situation.",
      "Avoid complaining excessively to people; instead speak to Allah who controls all states of expansion and restriction."
    ]
  },
  {
    "id": 33,
    "name_ar": "ٱلْبَاسِطُ",
    "name_bn": "Al-Basit",
    "meaning_bn": "The Expander",
    "virtues": "Allah expands sustenance, opportunities, happiness, love, and inner peace for whomever He wills. His expansion is filled with mercy—He gives without limits and grants relief after difficulty. Recognizing Allah as Al-Basit helps a believer stay grateful, humble, and generous when blessed with wealth or comfort.",
    "practices": [
      "When Allah increases your wealth, immediately give thanks and distribute charity, acknowledging that the blessing came from Him.",
      "Use any form of expansion—wealth, time, knowledge—to help people instead of showing arrogance.",
      "Make dua for Barakah (blessing) because true expansion is not quantity but quality and long-term goodness.",
      "Stay humble during ease, remembering that Allah can withhold and expand at any moment according to His wisdom."
    ]
  },
  {
    "id": 34,
    "name_ar": "ٱلْخَافِضُ",
    "name_bn": "Al-Khafid",
    "meaning_bn": "The Abaser",
    "virtues": "Allah lowers the status, power, or arrogance of individuals and nations. He humbles tyrants, exposes hypocrites, and reduces the honor of those who spread corruption. Sometimes He lowers a believer temporarily to purify them, deepen their faith, or protect them from greater harm. Understanding Al-Khafid teaches humility and fear of injustice.",
    "practices": [
      "Avoid arrogance, pride, and self-glorification because Allah humbles the arrogant regardless of their power.",
      "Treat people with fairness and avoid oppressing anyone, even in small matters, because Allah lowers the unjust.",
      "If life becomes difficult or humiliating, reflect—perhaps Allah is protecting you from a bigger danger or purifying your heart.",
      "Ask Allah to keep your heart humble and to protect you from becoming someone who misuses authority."
    ]
  },
  {
    "id": 35,
    "name_ar": "ٱلرَّافِعُ",
    "name_bn": "Ar-Rafi",
    "meaning_bn": "The Exalter",
    "virtues": "Allah raises the rank, honor, dignity, and spiritual status of whomever He wills—sometimes without worldly achievements. He raises people through sincerity, patience, humility, and righteousness, not wealth or power. He elevated prophets, scholars, worshippers, and those who remember Him. Recognizing Ar-Rafi gives hope that Allah can transform any condition and grant unexpected honor.",
    "practices": [
      "Increase good deeds secretly, as Allah loves to raise the rank of those who worship Him away from public eyes.",
      "Stay humble even when gaining respect or success, remembering that honor came from Allah, not personal effort alone.",
      "Be consistent in Salah, charity, and Quran—these acts elevate spiritual status in the sight of Allah.",
      "Avoid seeking fame and worldly validation; instead seek honor from Allah who raises the sincere and devoted."
    ]
  },
  {
    "id": 36,
    "name_ar": "ٱلْمُعِزُّ",
    "name_bn": "Al-Mu'izz",
    "meaning_bn": "The Bestower of Honor",
    "virtues": "Allah grants honor, dignity, and strength to whomever He wills. No human, government, wealth, or status can give true honor except by the decree of Allah. Real izzah (honor) comes through faith, sincerity, humility, and obedience to Allah. Recognizing Allah as Al-Mu'izz makes a believer understand that no humiliation from people can harm them if Allah has honored them, and no worldly honor can benefit if Allah has withheld it.",
    "practices": [
      "Stay humble during moments of recognition or success, because true honor comes only from Allah and not from worldly achievements.",
      "Honor others—parents, elders, teachers, and the poor—because Allah raises those who treat people with dignity.",
      "Seek honor through acts of worship such as Salah, charity, and good character rather than seeking fame or validation.",
      "Avoid sinful or unethical ways to gain status because they never bring real honor from Allah."
    ]
  },
  {
    "id": 37,
    "name_ar": "ٱلْمُذِلُّ",
    "name_bn": "Al-Mudhill",
    "meaning_bn": "The Humiliator",
    "virtues": "Allah is the One who humiliates the arrogant, the oppressors, the hypocrites, and those who turn away from truth. He strips people of false pride, exposes their corruption, and lowers their ranks when they transgress. His humiliation is justice, not cruelty. Understanding Al-Mudhill makes a believer fear arrogance and injustice, knowing that real humiliation is spiritual: losing Allah's guidance.",
    "practices": [
      "Always avoid arrogance, self-importance, and pride because Allah despises the arrogant and lowers them.",
      "Never humiliate others—whether verbally, financially, or publicly—because Allah may humiliate the oppressor in return.",
      "Make dua for protection from disgrace in dunya and Akhirah.",
      "If you see someone being humiliated, treat them kindly; Allah raises those who help the weak."
    ]
  },
  {
    "id": 38,
    "name_ar": "ٱلسَّمِيعُ",
    "name_bn": "As-Sami",
    "meaning_bn": "The All-Hearing",
    "virtues": "Allah hears every single sound—loud, soft, hidden, whispered, or even a silent cry of the heart. He hears every dua, every word of gratitude, and every complaint made in loneliness. Nothing escapes His hearing. Understanding As-Sami encourages a believer to make dua constantly and avoid harmful speech.",
    "practices": [
      "Make dua with deep sincerity, knowing that every request—even silent tears—is heard by Allah.",
      "Avoid gossip, insults, harsh speech, and lies because Allah hears all words.",
      "Increase dhikr quietly or loudly, as Allah hears every remembrance.",
      "Comfort others by speaking gently, since pleasing speech is beloved to Allah."
    ]
  },
  {
    "id": 39,
    "name_ar": "ٱلْبَصِيرُ",
    "name_bn": "Al-Baseer",
    "meaning_bn": "The All-Seeing",
    "virtues": "Allah sees everything—every action, emotion, injustice, sacrifice, and good deed done even in secret. His vision encompasses the smallest particle and every event in the universe. Recognizing Al-Baseer encourages sincerity and discourages secret sins.",
    "practices": [
      "Avoid sins when alone, because Allah sees you even when no one else does.",
      "Look at the world with gratitude and reflection, as Allah’s creation is a sign of His perfect sight.",
      "Protect your eyes from haram—pornography, indecency, and harmful content.",
      "Perform good deeds privately; Allah sees every act and rewards with justice."
    ]
  },
  {
    "id": 40,
    "name_ar": "ٱلْحَكَمُ",
    "name_bn": "Al-Hakam",
    "meaning_bn": "The Perfect Judge",
    "virtues": "Allah is the ultimate judge whose rulings are perfect, just, and full of wisdom. No one can overturn His judgment. He judges with truth on the Day of Judgment and also judges events in our lives with divine wisdom.",
    "practices": [
      "When wronged, trust that Allah will deliver perfect justice even if humans fail.",
      "Avoid judging others harshly; only Allah knows their intentions and inner truth.",
      "Follow the laws of Islam, knowing they come from the perfect Judge.",
      "Ask Allah to guide your decisions so they align with justice and wisdom."
    ]
  },
  {
    "id": 41,
    "name_ar": "ٱلْعَدْلُ",
    "name_bn": "Al-Adl",
    "meaning_bn": "The Utterly Just",
    "virtues": "Allah’s justice is absolute. He never wrongs anyone, even by an atom’s weight. He rewards every good deed, forgives sins through repentance, and punishes evil with complete fairness. His justice is not influenced by status, wealth, or power.",
    "practices": [
      "Treat family, children, employees, and strangers with fairness.",
      "Avoid favoritism or bias because injustice is a major sin.",
      "Speak up against injustice when possible.",
      "Reflect on your deeds regularly to avoid harming others intentionally or unintentionally."
    ]
  },
  {
    "id": 42,
    "name_ar": "ٱللَّطِيفُ",
    "name_bn": "Al-Lateef",
    "meaning_bn": "The Subtle and Most Gentle",
    "virtues": "Allah’s kindness is subtle and deeply gentle. He helps in ways we do not see, solves problems before they reach us, protects us from harm we never knew about, and guides our hearts softly. Recognizing Al-Lateef brings hope and trust in Allah’s soft mercy.",
    "practices": [
      "Look for Allah’s subtle blessings—small rescues, unexpected ease, and quiet protection.",
      "Be gentle with people because Allah loves gentleness.",
      "Make dua for hidden blessings and soft mercy specifically using this name.",
      "Avoid harshness; subtle kindness is more powerful."
    ]
  },
  {
    "id": 43,
    "name_ar": "ٱلْخَبِيرُ",
    "name_bn": "Al-Khabeer",
    "meaning_bn": "The All-Aware",
    "virtues": "Allah is fully aware of everything: the inner reality, hidden thoughts, true intentions, and every detail of the universe. His awareness is perfect, and He guides the sincere.",
    "practices": [
      "Purify your intentions because Allah knows what’s in the heart.",
      "Take time for self-reflection and accountability to improve your character.",
      "Trust Allah’s plan as He knows your situation better than anyone.",
      "Avoid manipulation or deception; Allah is fully aware of all."
    ]
  },
  {
    "id": 44,
    "name_ar": "ٱلْحَلِيمُ",
    "name_bn": "Al-Haleem",
    "meaning_bn": "The Forbearing",
    "virtues": "Allah is patient and does not punish us immediately for our sins. He waits, gives chances, opens doors for repentance, and shows tremendous tolerance. His forbearance is a sign of deep mercy.",
    "practices": [
      "Be patient with people’s mistakes, just as Allah is patient with yours.",
      "Control anger and respond calmly even when provoked.",
      "Take time to think before reacting.",
      "Increase repentance while remembering Allah’s patience."
    ]
  },
  {
    "id": 45,
    "name_ar": "ٱلْعَظِيمُ",
    "name_bn": "Al-Azeem",
    "meaning_bn": "The Magnificent, The Supreme",
    "virtues": "Allah’s greatness cannot be measured, compared, or fully understood. His power, knowledge, and sovereignty extend beyond creation. Reflecting on His greatness increases humility and faith.",
    "practices": [
      "Say 'Subhana Rabbiyal Azeem' in ruku with deep reflection.",
      "Avoid arrogance; remember your smallness before the Creator.",
      "Reflect on the vastness of the universe as a sign of Allah’s greatness.",
      "Honor the Quran, His words, with utmost respect."
    ]
  },
  {
    "id": 46,
    "name_ar": "ٱلْغَفُورُ",
    "name_bn": "Al-Ghafur",
    "meaning_bn": "The Most Forgiving",
    "virtues": "Allah forgives repeatedly, no matter how many sins a person commits—if they repent sincerely. His forgiveness covers major, minor, open, and hidden sins.",
    "practices": [
      "Repent daily with sincerity and shame before Allah.",
      "Forgive people even if they wrong you.",
      "Encourage others to seek Allah’s forgiveness.",
      "Avoid despair; no sin is too big for Allah’s mercy."
    ]
  },
  {
    "id": 47,
    "name_ar": "ٱلشَّكُورُ",
    "name_bn": "Ash-Shakoor",
    "meaning_bn": "The Most Appreciative",
    "virtues": "Allah appreciates even the smallest good deed and rewards it greatly. A small charity becomes huge in His sight.",
    "practices": [
      "Do small good deeds consistently.",
      "Thank Allah for blessings verbally and through actions.",
      "Appreciate people as Allah appreciates His creation.",
      "Avoid complaining excessively."
    ]
  },
  {
    "id": 48,
    "name_ar": "ٱلْعَلِيُّ",
    "name_bn": "Al-Aliyy",
    "meaning_bn": "The Most High",
    "virtues": "Allah is above all limitations, imperfections, and comparisons. His rank is infinitely high and unmatched.",
    "practices": [
      "Say 'Allahu Akbar' with meaning—Allah is higher than all problems.",
      "Avoid attaching your heart to worldly status.",
      "Raise your spiritual level by worship and humility."
    ]
  },
  {
    "id": 49,
    "name_ar": "ٱلْكَبِيرُ",
    "name_bn": "Al-Kabeer",
    "meaning_bn": "The Most Great",
    "virtues": "Allah’s greatness surpasses all imagination, and acknowledging this brings humility, awe, and reliance on Him alone.",
    "practices": [
      "Avoid glorifying yourself; greatness belongs to Allah.",
      "Magnify Allah in your Salah and dua.",
      "Remember Allah’s greatness in difficulties."
    ]
  },
  {
    "id": 50,
    "name_ar": "ٱلْحَفِيظُ",
    "name_bn": "Al-Hafeez",
    "meaning_bn": "The Protector",
    "virtues": "Allah protects His creation, physical bodies, souls, hearts, and even iman. His protection is perfect and constant.",
    "practices": [
      "Make dua for protection daily (Ayat-ul-Kursi, morning & evening adhkar).",
      "Avoid sinful places; protection comes with obedience.",
      "Trust Allah’s protection more than worldly safeguards."
    ]
  },
{
"id": 51,
"name_ar": "ٱلْحَقُّ",
"name_bn": "Al-Haqq",
"meaning_bn": "The Absolute Truth",
"virtues": "Allah is the ultimate source of truth and reality. Everything that exists continues only because of the truth Allah has established. Belief in Al-Haqq removes confusion, doubts, fear of people, and the pressure to impress others. It builds moral clarity and makes a person courageous against injustice. In relationships, business, leadership, and community, a believer who embodies Al-Haqq becomes trustworthy, stable, consistent, and respected. This name strengthens the heart to stand with justice even if the world opposes it.",
"practices": [
"Be truthful even when lying may benefit you temporarily—e.g., telling the truth in business loss reports or academic mistakes.",
"Avoid backbiting, exaggeration, and manipulation in daily speech.",
"If you make a mistake, openly admit it instead of covering it.",
"Stand up for someone being mistreated at work or school.",
"Before making decisions, make dua: 'Ya Haqq, guide me to the truth and make me firm upon it.'"
]
},
{
"id": 52,
"name_ar": "ٱلْوَكِيلُ",
"name_bn": "Al-Wakeel",
"meaning_bn": "The Supreme Trustee",
"virtues": "Allah manages every affair of every creature perfectly. Belief in Al-Wakeel frees you from overthinking and anxiety. It teaches reliance on Allah after doing your best effort. People who trust Al-Wakeel are emotionally strong, highly stable in crises, and able to continue life even after losses because they know Allah never mismanages their destiny. This name builds optimism, patience, and mental peace.",
"practices": [
"Apply for jobs, work hard—but leave the result entirely to Allah.",
"During stress or panic attacks, recite: 'Hasbunallahu wa ni'mal wakeel.'",
"Start new projects without fear of failure—trust Allah with outcomes.",
"If a plan fails, reflect peacefully instead of breaking down emotionally.",
"Encourage family to trust Allah instead of relying only on people."
]
},
{
"id": 53,
"name_ar": "ٱلْقَوِيُّ",
"name_bn": "Al-Qawiyy",
"meaning_bn": "The All-Strong",
"virtues": "Allah’s strength has no limit, no weakness, no fatigue. A person who understands this becomes fearless. Emotional strength, mental discipline, stability in faith, and courage against sin all come from belief in Al-Qawiyy. This name helps overcome internal battles—addiction, anxiety, fear, and laziness. It develops willpower with divine support.",
"practices": [
"Ask Allah for strength while struggling with bad habits or addiction.",
"Stay firm in prayer even when your environment is filled with sin.",
"Recite: 'Ya Qawiyy, strengthen me' before difficult tasks.",
"Encourage others facing weakness by reminding them of Allah’s power.",
"Overcome fear of people by recognizing the strength of Allah alone."
]
},
{
"id": 54,
"name_ar": "ٱلْمَتِينُ",
"name_bn": "Al-Mateen",
"meaning_bn": "The Firm, The Unbreakable",
"virtues": "Allah is perfectly stable, consistent, unshakable. He does not change, weaken, or forget. Belief in Al-Mateen gifts emotional durability. You stop breaking down easily. Your faith becomes firm even in hardship. You become dependable and consistent in good habits. This name creates long-term spiritual strength.",
"practices": [
"Stick to your worship routine (prayer, Quran) even on busy days.",
"Avoid emotional reactions—practice calmness in arguments.",
"Set long-term goals and pursue them with discipline.",
"Reflect daily on Allah’s firmness and ask Him to make you steadfast.",
"Practice patience during trials by saying: 'Ya Mateen, make me firm.'"
]
},
{
"id": 55,
"name_ar": "ٱلْوَلِيُّ",
"name_bn": "Al-Waliyy",
"meaning_bn": "The Protecting Ally",
"virtues": "Allah becomes the personal guardian, helper, and close friend of the believer. This name brings emotional healing, comfort, and spiritual companionship. People who feel alone, heartbroken, or betrayed find deep peace in Al-Waliyy. When Allah takes someone as His Wali, He guides their decisions, protects their heart from harm, and strengthens their soul.",
"practices": [
"Pray Tahajjud and speak to Allah like a trusted friend.",
"When confused, make dua: 'Ya Waliyy, guide me to what is best.'",
"Detach from harmful friendships trusting Allah to replace them.",
"Ask Allah to protect your heart from toxic relationships.",
"Be a guardian to others—protect the weak, support the oppressed."
]
},
{
"id": 56,
"name_ar": "ٱلْحَمِيدُ",
"name_bn": "Al-Hamid",
"meaning_bn": "The Praiseworthy",
"virtues": "Allah deserves praise at all times—during joy, hardship, loss, and success. Belief in Al-Hamid creates a grateful personality. Gratitude brings happiness, reduces jealousy, improves relationships, and strengthens faith. In real life, people who praise Allah are emotionally lighter and mentally healthier.",
"practices": [
"Say 'Alhamdulillah' in every situation—good or bad.",
"Avoid comparing your life to others; appreciate your blessings.",
"Keep a gratitude journal listing 3 blessings daily.",
"Praise Allah when receiving salary, food, shelter, or safety.",
"Teach children gratitude by thanking Allah together after meals."
]
},
{
"id": 57,
"name_ar": "ٱلْمُحْصِي",
"name_bn": "Al-Muhsi",
"meaning_bn": "The Accounter",
"virtues": "Allah counts every action, intention, word, and thought. Nothing is lost. This creates high self-awareness. A believer becomes responsible and conscious of behavior. It reduces sinful habits and promotes moral discipline. It also makes a person hopeful because even the smallest good deed is recorded.",
"practices": [
"Review your day every night—what sins, what good deeds.",
"Avoid secret sins knowing Allah records every intention.",
"Give charity even if small—it will be counted.",
"Speak carefully; pause before gossip or anger.",
"Make dua: 'Ya Muhsi, record me among the righteous.'"
]
},
{
"id": 58,
"name_ar": "ٱلْمُبْدِئُ",
"name_bn": "Al-Mubdi’",
"meaning_bn": "The Originator",
"virtues": "Allah creates from nothing. He opens new paths, new ideas, new beginnings. Belief in Al-Mubdi’ builds creativity, hope, and confidence. Even when life hits rock bottom, Allah can create a completely new chapter. This name is powerful for those who feel stuck, lost, or hopeless.",
"practices": [
"Start any new habit with Bismillah even if you feel unprepared.",
"Ask Allah for creative ideas in business, work, or studies.",
"Do not fear restarting life after failure—Allah opens new doors.",
"When heart feels empty, ask Allah to originate new light inside you.",
"Sit in reflection (muraqaba) and remind yourself of Allah’s creation."
]
},
{
"id": 59,
"name_ar": "ٱلْمُعِيدُ",
"name_bn": "Al-Mu‘id",
"meaning_bn": "The Restorer",
"virtues": "Allah returns life after death, restores blessings after they are lost, and rebuilds broken souls. Belief in Al-Mu’id builds resilience and emotional recovery. Even after trauma, loss, heartbreak, spiritual decline—Allah can return everything better than before.",
"practices": [
"If you fall into sin, repent immediately—Allah restores your purity.",
"Ask Allah to rebuild your broken relationships with wisdom.",
"If you lose money, trust that Allah can return it in unexpected ways.",
"Recite: 'Ya Mu’id, restore my iman' when feeling spiritually weak.",
"Help others rebuild their lives—be a source of restoration."
]
},
{
"id": 60,
"name_ar": "ٱلْمُحْيِي",
"name_bn": "Al-Muhyi",
"meaning_bn": "The Giver of Life",
"virtues": "Allah gives physical life and spiritual life. Hearts that become dead from sin, depression, or ignorance can come alive through His light. This name gives hope to people who feel spiritually numb or emotionally lifeless.",
"practices": [
"Read Quran daily—it revives the heart.",
"Pray 2 rakat seeking spiritual life.",
"Help revive others by teaching them something beneficial.",
"Ask Allah to give life to your goals, dreams, and faith.",
"Leave sins that kill the heart (pornography, gossip, arrogance)."
]
},
{
"id": 61,
"name_ar": "ٱلْمُمِيتُ",
"name_bn": "Al-Mumit",
"meaning_bn": "The Giver of Death",
"virtues": "Allah gives death with wisdom—sometimes early, sometimes late, always perfectly timed. Reflecting on Al-Mumit brings humility, seriousness, and purpose in life. It removes arrogance and awakens a person from heedlessness.",
"practices": [
"Visit graves to soften the heart.",
"Live each day as if it could be the last.",
"Forgive others quickly; life is short.",
"Quit sins immediately—they may cause a bad ending.",
"Make dua for a beautiful death (husnul khatimah)."
]
},
{
"id": 62,
"name_ar": "ٱلْحَيُّ",
"name_bn": "Al-Hayy",
"meaning_bn": "The Ever-Living",
"virtues": "Allah is eternally alive; His life is perfect, independent, without sleep, illness, or weakness. This name gives courage—because believers rely on a Lord who never dies, never forgets, and never abandons them.",
"practices": [
"Call upon Allah during fear: 'Ya Hayy, protect me.'",
"Rely on Allah, not on temporary people.",
"Strengthen your spiritual life through constant dhikr.",
"Avoid depending entirely on relationships—they are mortal.",
"Revive your intentions often, remembering Allah is always watching."
]
},
{
"id": 63,
"name_ar": "ٱلْقَيُّومُ",
"name_bn": "Al-Qayyum",
"meaning_bn": "The Self-Existing Sustainer",
"virtues": "Everything exists only because Allah sustains it. This name brings contentment, peace, and freedom from relying too much on people. It reminds believers that life, provision, health, and success all stand by Allah’s command.",
"practices": [
"In hardship say: 'Ya Hayyu Ya Qayyum, birahmatika astagheeth.'",
"When emotionally drained, ask Allah for inner strength.",
"Stop relying excessively on people for validation.",
"Develop habits of self-discipline knowing Allah sustains you.",
"Trust that Allah will maintain your affairs even when you feel weak."
]
},
{
"id": 64,
"name_ar": "ٱلْوَاجِدُ",
"name_bn": "Al-Wajid",
"meaning_bn": "The Perceiver, The Finder",
"virtues": "Allah finds everything—nothing is hidden from Him. He is never in need, never missing anything. This name builds deep awareness and closeness to Allah.",
"practices": [
"Avoid sins in private—Allah perceives everything.",
"Practice muraqaba (silent awareness of Allah).",
"Find blessings around you and thank Allah for each one.",
"Seek Allah’s presence during stress; He is never far.",
"Clean your heart from hypocrisy and deceit."
]
},
{
"id": 65,
"name_ar": "ٱلْمَاجِدُ",
"name_bn": "Al-Majid",
"meaning_bn": "The Glorious, The Noble",
"virtues": "Allah is the possessor of unlimited glory, honor, and generosity. This name fills the heart with admiration and love for Allah. It makes a believer dignified, honorable, and generous.",
"practices": [
"Avoid dishonorable behavior—lying, cheating, rudeness.",
"Show generosity to family and strangers.",
"Maintain dignity in speech and conduct.",
"Praise Allah’s majesty in sujood.",
"Act with nobility even when others behave poorly."
]
},
{
"id": 66,
"name_ar": "ٱلْوَاحِدُ",
"name_bn": "Al-Wahid",
"meaning_bn": "The One",
"virtues": "Allah is One—unique, without partner. This name strengthens Tawheed and removes fear of people. It also builds unity within the heart.",
"practices": [
"Purify your intention—do things only for Allah.",
"Avoid showing off (riya).",
"Do not fear people; fear Allah alone.",
"Keep your heart focused in prayer.",
"Strengthen Tawheed through dhikr."
]
},
{
"id": 67,
"name_ar": "ٱلصَّمَدُ",
"name_bn": "As-Samad",
"meaning_bn": "The Self-Sufficient Master",
"virtues": "Allah needs no one, yet everyone needs Him. As-Samad provides emotional healing. When you feel abandoned, betrayed, or unsupported, this name becomes a refuge.",
"practices": [
"Call upon Allah directly—He never rejects.",
"When heartbroken, read Surah Ikhlas repeatedly.",
"Stop begging emotional support from people.",
"Strengthen inner independence—depend on Allah.",
"Give charity because Allah provides endlessly."
]
},
{
"id": 68,
"name_ar": "ٱلْقَادِرُ",
"name_bn": "Al-Qadir",
"meaning_bn": "The All-Powerful",
"virtues": "Allah can do anything—no limitation, no difficulty. This name builds hope in impossible situations. Patients recover, debts vanish, problems dissolve—all by His power.",
"practices": [
"Ask Allah for help in tasks that seem impossible.",
"Do not give up on duas; Allah’s power is unlimited.",
"Attempt big goals with trust in Allah.",
"Help others remember Allah’s power in their struggles.",
"Say: 'Ya Qadir, open the doors that seem closed.'"
]
},
{
"id": 69,
"name_ar": "ٱلْمُقْتَدِرُ",
"name_bn": "Al-Muqtadir",
"meaning_bn": "The All-Controling Power",
"virtues": "Allah’s power is precise, exact, and perfect. Nothing happens randomly. Every event in your life is calculated with wisdom. This name brings deep calm during chaos.",
"practices": [
"Trust Allah during unexpected events.",
"Reflect on how past hardships shaped you.",
"Practice patience—Allah’s plan is flawless.",
"Avoid blaming destiny; embrace Allah’s wisdom.",
"Say: 'Ya Muqtadir, arrange my affairs perfectly.'"
]
},
{
"id": 70,
"name_ar": "ٱلْمُقَدِّمُ",
"name_bn": "Al-Muqaddim",
"meaning_bn": "The Promoter, The One Who Brings Forward",
"virtues": "Allah elevates whom He wills—spiritually, socially, materially. He brings opportunities, blessings, and growth. This name gives hope to those overlooked.",
"practices": [
"Ask Allah to advance your career or studies.",
"Do not envy others—Allah raises whom He wills.",
"Support others' success; Allah will promote you too.",
"Prepare yourself with hard work—Allah promotes the deserving.",
"Say: 'Ya Muqaddim, bring me forward in goodness.'"
]
},
{
"id": 71,
"name_ar": "ٱلْمُؤَخِّرُ",
"name_bn": "Al-Mu’akhkhir",
"meaning_bn": "The Delayer",
"virtues": "Allah delays certain things from His slaves out of perfect wisdom—sometimes to protect them, sometimes to elevate their ranks, sometimes to test their sincerity. Understanding Al-Mu’akhkhir teaches a believer that delays are not rejection; they are divine timing. Many people fall into despair when duas seem unanswered, but this name builds emotional maturity. A believer learns that Allah may delay marriage to save them from toxic partners, delay wealth to keep their heart pure, delay success to build their skills, delay punishment out of mercy, and delay hardship until they are strong enough to handle it. Al-Mu’akhkhir helps a believer fight jealousy, impatience, and negative comparison with others.",
"practices": [
"When a dua seems delayed, say: 'Ya Mu’akhkhir, delay only what is bad for me and hasten what is good.'",
"Instead of giving up during long tests, remain consistent in ibadah.",
"When you see others succeed before you, remind yourself that Allah’s timing for you is different.",
"Practice patience and avoid complaining—trust Allah’s schedule.",
"Use delays as opportunities to develop skills, character, and spiritual depth."
]
},
{
"id": 72,
"name_ar": "ٱلْأَوَّلُ",
"name_bn": "Al-Awwal",
"meaning_bn": "The First",
"virtues": "Allah existed before everything—before time, before the universe, before every creation. Belief in Al-Awwal wipes away fear of the future, grief of the past, and attachment to temporary things. It grounds the heart in timelessness. When a believer understands that Allah is the first of all things, he realizes that every blessing, opportunity, breath, and moment originates from Allah. This creates calmness during uncertainty and gratitude during comfort. It also removes arrogance, reminding us that we started from nothing.",
"practices": [
"Begin every project, job, and decision with Allah’s name and dua.",
"If you worry about your past mistakes, remind yourself that Allah came before even your sins and His mercy is older than your wrongs.",
"Start your day with dhikr of Al-Awwal to anchor your heart.",
"Teach children to always start tasks by saying 'Bismillah'.",
"Reflect every morning that all success begins with Allah—not with your skills alone."
]
},
{
"id": 73,
"name_ar": "ٱلْآخِرُ",
"name_bn": "Al-Aakhir",
"meaning_bn": "The Last",
"virtues": "Everything ends except Allah. Belief in Al-Aakhir brings deep inner peace. It frees the heart from the fear of loss—loss of wealth, relationships, beauty, youth, and status. When a believer understands that Allah remains after everything else fades, he becomes emotionally stable, spiritually focused, and less attached to temporary worldly glamour. This name builds long-term perspective and protects from wasting life on trivial pursuits.",
"practices": [
"At night, reflect that all worldly activities end, but your deeds remain.",
"Avoid sinful pleasures remembering their enjoyment is short but consequences are long.",
"Console yourself after heartbreak—people leave, but Allah remains.",
"During funerals or illness, remember Al-Aakhir to develop humility.",
"Set life goals that will matter in the Hereafter, not just the world."
]
},
{
"id": 74,
"name_ar": "ٱلظَّاهِرُ",
"name_bn": "Az-Zahir",
"meaning_bn": "The Manifest",
"virtues": "Allah’s signs are visible everywhere—in the sky, nature, science, emotions, destiny, and human life. Belief in Az-Zahir strengthens conviction in Allah’s existence and removes doubts. This name awakens the heart to observe divine patterns: how Allah rescues you unexpectedly, how He gives comfort during sadness, how He arranges opportunities at the right time. It makes a believer spiritually alert and grateful.",
"practices": [
"Contemplate nature: stars, rain, mountains—each reflects Allah’s power.",
"Notice how blessings appear at unexpected moments.",
"Observe your body’s design and thank Allah for every system working perfectly.",
"When doubting, study science or Quranic miracles—they reveal Allah.",
"Teach children to see Allah’s signs in everyday life."
]
},
{
"id": 75,
"name_ar": "ٱلْبَاطِنُ",
"name_bn": "Al-Batin",
"meaning_bn": "The Hidden",
"virtues": "Allah is unseen yet closer than your heartbeat. He knows your inner struggles, secrets, pain, intentions, and silent duas. Belief in Al-Batin develops sincerity, emotional healing, and deep connection with Allah. Even when you cannot express your feelings to people, Allah understands perfectly. This name gives comfort to lonely hearts.",
"practices": [
"Make private duas for things you cannot express aloud.",
"Perform acts of worship secretly, purely for Allah.",
"Clean your heart—remove envy, hatred, arrogance.",
"Trust Allah when no one understands your pain.",
"During sadness, sit in silence and speak to Allah internally."
]
},
{
"id": 76,
"name_ar": "ٱلْوَالِي",
"name_bn": "Al-Wali",
"meaning_bn": "The Sole Planner",
"virtues": "Allah manages the universe with flawless order. Nothing is random. Belief in Al-Wali strengthens trust in Allah’s planning. A believer becomes calm when life takes unexpected turns because he knows that Allah’s arrangement is always better than human planning. This name helps overcome regrets and overthinking.",
"practices": [
"When plans fail, say: 'Ya Wali, arrange what is best for me.'",
"Avoid regret—trust that Allah protected you from hidden harm.",
"Live with tawakkul instead of excessive stress.",
"Make purposeful decisions and leave unseen matters to Allah.",
"Reflect on past events to see how Allah arranged them perfectly."
]
},
{
"id": 77,
"name_ar": "ٱلْمُتَعَالِي",
"name_bn": "Al-Muta‘ali",
"meaning_bn": "The Supremely Exalted",
"virtues": "Allah is far above weaknesses, limitations, human flaws, and worldly imperfections. This name fills the heart with reverence and humbles the ego. It reminds a believer that no matter how powerful a person becomes—wealthy, famous, intelligent—they can never reach even a fraction of Allah’s majesty. This makes the believer modest, obedient, and spiritually elevated.",
"practices": [
"Avoid arrogance in knowledge, wealth, beauty, or status.",
"Praise Allah’s greatness during sujood.",
"Handle success with humility—recognize Allah raised you.",
"Encourage others to seek honor through Allah, not through people.",
"Reflect on the vastness of the universe to recognize Allah’s supremacy."
]
},
{
"id": 78,
"name_ar": "ٱلْبَرُّ",
"name_bn": "Al-Barr",
"meaning_bn": "The Source of Goodness",
"virtues": "Allah is the giver of pure kindness, compassion, mercy, and blessings—whether we deserve them or not. Belief in Al-Barr brings hope for forgiveness and love for Allah. It transforms the believer’s heart into one that is gentle, grateful, and eager to do good. This name is especially healing for those who grew up with harshness or trauma—Allah’s kindness is unmatched.",
"practices": [
"Be kind to others even if they don’t repay you.",
"Give charity regularly—even small amounts.",
"Forgive people for your own peace and Allah’s pleasure.",
"Show kindness to parents, orphans, and the poor.",
"Increase good deeds secretly for sincerity."
]
},
{
"id": 79,
"name_ar": "ٱلْمُنْتَقِمُ",
"name_bn": "Al-Muntaqim",
"meaning_bn": "The Avenger",
"virtues": "Allah punishes oppressors with perfect justice. Belief in Al-Muntaqim prevents the heart from seeking revenge in destructive ways. It brings comfort to those who were harmed, mistreated, betrayed, or abused—Allah will take justice even if humans fail. This name also warns sinners and oppressors to repent.",
"practices": [
"Avoid injustice, oppression, and harming others.",
"If someone wrongs you, trust Allah for justice instead of revenge.",
"Make dua for protection from being among the oppressors.",
"Advocate for victims and raise your voice against injustice.",
"Hold yourself accountable—repent before consequences appear."
]
},
{
"id": 80,
"name_ar": "ٱلْعَفُوُّ",
"name_bn": "Al-Afuww",
"meaning_bn": "The Pardoner",
"virtues": "Allah erases sins completely—not just forgives but wipes them from records. Belief in Al-Afuww brings hope for a fresh start after mistakes. It heals guilt, shame, and regret. It also inspires the believer to adopt a forgiving personality, letting go of grudges for inner peace.",
"practices": [
"Recite this name excessively in Ramadan and during Tahajjud.",
"Forgive people even if they don’t apologize—it’s for your peace.",
"Avoid constantly reminding others of their past mistakes.",
"Make dua: 'Allahumma innaka Afuwwun tuhibbul afwa fa’fu anni.'",
"Help others rebuild their life after they repent from wrongs."
]
},

{
"id": 81,
"name_ar": "ٱلرَّؤُوفُ",
"name_bn": "Ar-Ra’oof",
"meaning_bn": "The Most Kind",
"virtues": "Allah’s kindness is beyond imagination—He protects us from unseen dangers, forgives repeatedly, and gives blessings even when we are undeserving. Belief in Ar-Ra’oof softens the heart, reduces anger, and increases empathy. A believer becomes gentle with people, animals, and nature.",
"practices": [
"Speak kindly, even during disagreements.",
"Help the elderly, weak, or sick without expecting reward.",
"Show mercy to animals—feed strays, avoid harming them.",
"Practice gentle parenting and avoid shouting.",
"Reflect daily on small mercies Allah gives—safety, sleep, food, family."
]
},
{
"id": 82,
"name_ar": "مَالِكُ ٱلْمُلْك",
"name_bn": "Malik-ul-Mulk",
"meaning_bn": "Owner of Sovereignty",
"virtues": "Allah owns all dominion—kingdoms, wealth, status, time, life, death. This name removes pride and jealousy and strengthens trust in Allah during financial or social instability. A believer realizes that no government, employer, or person controls destiny—only Allah does.",
"practices": [
"Ask Allah for provision rather than depending fully on employers.",
"Give charity to acknowledge Allah’s ownership.",
"Lose arrogance—everything you have is Allah’s gift.",
"Give credit to Allah after achievements.",
"Pray for righteous leaders and stable society."
]
},
{
"id": 83,
"name_ar": "ذُو ٱلْجَلَالِ وَٱلْإِكْرَامِ",
"name_bn": "Dhul-Jalali wal-Ikram",
"meaning_bn": "Lord of Majesty and Honor",
"virtues": "Allah combines unmatched majesty with perfect generosity. This name inspires awe and deep love. A believer becomes dignified, honorable, and grateful. It builds a balance of fear and hope—fear of Allah’s majesty, hope in His generosity.",
"practices": [
"Recite this name after every prayer.",
"Avoid humiliating or disrespecting others.",
"Be generous—reflect Allah’s honor.",
"Treat Quran with utmost respect.",
"Honor parents, teachers, scholars, and guests."
]
},
{
"id": 84,
"name_ar": "ٱلْمُقْسِطُ",
"name_bn": "Al-Muqsit",
"meaning_bn": "The Just and Equitable",
"virtues": "Allah establishes justice with absolute fairness. Belief in Al-Muqsit encourages honesty, fairness, and moral courage. It makes a believer trustworthy in business and relationships. This name restores faith for victims of injustice—Allah will compensate perfectly.",
"practices": [
"Avoid cheating in business, exams, or relationships.",
"Return people’s rights fully—no shortcuts.",
"Judge fairly when resolving disputes.",
"Support justice even if against your own interest.",
"Apologize immediately when you wrong someone."
]
},
{
"id": 85,
"name_ar": "ٱلْجَامِعُ",
"name_bn": "Al-Jami‘",
"meaning_bn": "The Gatherer",
"virtues": "Allah gathers people, hearts, families, blessings, and deeds. He will gather all humanity on the Day of Judgment. Belief in Al-Jami’ gives hope for reunion with loved ones and helps mend broken relationships. It also encourages building unity in society.",
"practices": [
"Try to bring family members together—avoid division.",
"Participate in community-building activities.",
"During loneliness, make dua to be united with righteous people.",
"Value relationships over ego.",
"Remember the gathering of Akhirah and prepare for it."
]
},
{
"id": 86,
"name_ar": "ٱلْغَنِيُّ",
"name_bn": "Al-Ghaniyy",
"meaning_bn": "The Self-Sufficient",
"virtues": "Allah needs no one, but everyone needs Him. Understanding Al-Ghaniyy helps believers avoid begging for validation, attention, or approval. It builds dignity, independence, and self-respect. It also creates generosity—because giving does not decrease wealth when the Provider is Allah.",
"practices": [
"Stop depending on people emotionally—depend on Allah.",
"Give charity without fear of poverty.",
"Avoid showing desperation in relationships.",
"Thank Allah for financial blessings.",
"Develop skills and work hard while relying on Allah."
]
},
{
"id": 87,
"name_ar": "ٱلْمُغْنِي",
"name_bn": "Al-Mughni",
"meaning_bn": "The Enricher",
"virtues": "Allah enriches hearts with contentment, enriches minds with knowledge, enriches souls with faith, and enriches people with wealth. True richness is not money—it is inner peace. Belief in Al-Mughni reduces greed and increases gratitude.",
"practices": [
"Ask Allah to enrich your heart, not just your wallet.",
"Avoid haram income—Allah enriches through halal.",
"Help people find jobs or resources.",
"Share knowledge generously.",
"Avoid comparing wealth with others."
]
},
{
"id": 88,
"name_ar": "ٱلْمَانِعُ",
"name_bn": "Al-Mani‘",
"meaning_bn": "The Preventer",
"virtues": "Allah prevents harm, sin, toxic relationships, diseases, and disasters. Sometimes we want something badly, but Allah blocks it out of mercy. Belief in Al-Mani’ builds trust during rejection or closed doors. A believer learns that what Allah prevents is for their benefit.",
"practices": [
"When a plan is blocked, say: 'Ya Mani‘, protect me from what I don’t know.'",
"Avoid forcing things that Allah is blocking.",
"Thank Allah when saved from accidents or harmful people.",
"Leave places of sin—Allah prevents you from destruction.",
"Strengthen boundaries to avoid spiritual harm."
]
},
{
"id": 89,
"name_ar": "ٱلضَّارُّ",
"name_bn": "Ad-Darr",
"meaning_bn": "The Giver of Harm (with wisdom)",
"virtues": "Allah allows temporary harm only when necessary for growth, purification, or protection. No illness, heartbreak, or loss happens without purpose. Belief in Ad-Darr helps believers accept hardships gracefully, understanding they shape stronger faith.",
"practices": [
"During hardship, say: 'Allah chose this for my growth.'",
"Avoid blaming destiny; look for lessons instead.",
"Support others during their trials.",
"Stay away from sins—they bring spiritual harm.",
"Have patience when plans collapse unexpectedly."
]
},
{
"id": 90,
"name_ar": "ٱلنَّافِعُ",
"name_bn": "An-Nafi‘",
"meaning_bn": "The Giver of Benefit",
"virtues": "All benefit—health, knowledge, peace, success, rizq—comes from Allah alone. Belief in An-Nafi‘ makes the believer optimistic and proactive. It teaches that any good is possible anytime through Allah’s will.",
"practices": [
"Ask Allah to place benefit in your work, studies, and family.",
"Help others sincerely without expecting return.",
"Teach beneficial knowledge.",
"Avoid harmful habits like smoking, gossip, or procrastination.",
"Make dua for barakah in your daily life."
]
},
{
"id": 91,
"name_ar": "ٱلنُّورُ",
"name_bn": "An-Nur",
"meaning_bn": "The Light",
"virtues": "Allah is the source of spiritual, emotional, and intellectual light. He illuminates hearts with guidance, removes confusion, and brings clarity in decision-making. Belief in An-Nur helps believers escape darkness of sin, depression, anxiety, and purposelessness.",
"practices": [
"Recite Quran—it brings light to the heart.",
"Stay away from sins that darken the soul.",
"Keep your environment clean and bright.",
"Seek clarity from Allah during confusion.",
"Be a source of light—spread positivity, kindness, and good advice."
]
},
{
"id": 92,
"name_ar": "ٱلْهَادِي",
"name_bn": "Al-Hadi",
"meaning_bn": "The Guide",
"virtues": "Allah guides hearts to truth, purity, and righteousness. Without His guidance, knowledge alone is not enough. Belief in Al-Hadi keeps the believer humble—guidance is a gift, not an achievement. It inspires dua, repentance, and constant learning.",
"practices": [
"Before major decisions, pray: 'Ya Hadi, guide me.'",
"Study Quran and Sunnah for deeper guidance.",
"Avoid arrogance—guidance is from Allah, not your intelligence.",
"Guide others who are confused with wisdom.",
"Stay in environments that strengthen iman."
]
},
{
"id": 93,
"name_ar": "ٱلْبَدِيعُ",
"name_bn": "Al-Badi‘",
"meaning_bn": "The Incomparable Creator",
"virtues": "Allah creates without example—every snowflake, every soul, every leaf is unique. Belief in Al-Badi‘ inspires creativity, innovation, and appreciation of diversity. It helps people accept their unique qualities and stop comparing themselves to others.",
"practices": [
"Use your creative skills to benefit others.",
"Celebrate your uniqueness—Allah created you intentionally.",
"Avoid copying others blindly; embrace your path.",
"Contemplate nature’s diversity.",
"Innovate solutions in your work or studies."
]
},
{
"id": 94,
"name_ar": "ٱلْبَاقِي",
"name_bn": "Al-Baqi",
"meaning_bn": "The Everlasting",
"virtues": "Everything fades—beauty, youth, wealth, fame, buildings, civilizations—except Allah. Belief in Al-Baqi grounds the heart in eternal priorities. It reduces materialism and strengthens preparation for the Hereafter.",
"practices": [
"Invest more in good deeds than in temporary luxuries.",
"Control material desires—focus on what lasts.",
"Support charitable projects that benefit generations.",
"Meditate on the temporary nature of life.",
"Spend time with Quran, the everlasting guidance."
]
},
{
"id": 95,
"name_ar": "ٱلْوَارِثُ",
"name_bn": "Al-Warith",
"meaning_bn": "The Inheritor",
"virtues": "Everything humans own will return to Allah—houses, land, money, fame, children, nations. This name teaches humility and detachment from worldly greed. It reminds believers to use blessings responsibly before returning to Allah.",
"practices": [
"Write a halal will and give charity regularly.",
"Avoid hoarding wealth excessively.",
"Prioritize deeds that outlive you—knowledge, charity, kindness.",
"Mentally prepare that all wealth is temporary.",
"Visit graveyards to remember your final return."
]
},
{
"id": 96,
"name_ar": "ٱلرَّشِيدُ",
"name_bn": "Ar-Rashid",
"meaning_bn": "The Guide to the Right Path",
"virtues": "Allah guides believers to wise decisions, correct understanding, and righteous lifestyles. Belief in Ar-Rashid helps avoid confusion, toxic influences, and harmful choices. It builds clarity, wisdom, and maturity.",
"practices": [
"Ask Allah for wisdom before making decisions.",
"Seek advice from knowledgeable people.",
"Avoid environments that cloud judgment.",
"Reflect on mistakes to become wiser.",
"Teach others to make better choices."
]
},
{
"id": 97,
"name_ar": "ٱلصَّبُورُ",
"name_bn": "As-Sabur",
"meaning_bn": "The Most Patient",
"virtues": "Allah never rushes, never reacts emotionally, never gets frustrated. His timing is perfect and filled with mercy. Belief in As-Sabur develops emotional control, inner peace, and long-term patience. It helps believers stay committed during long struggles—whether spiritual, financial, academic, or emotional.",
"practices": [
"Practice deep breathing and reflection before reacting.",
"Increase acts of worship slowly but consistently.",
"Avoid complaining excessively—Allah is patient with you.",
"Show patience in parenting, relationships, and work.",
"During hardships, remind yourself: ‘Allah is patient with me; I must be patient too.’"
]
},
{
"id": 98,
"name_ar": "اللَّه",
"name_bn": "Allah",
"meaning_bn": "The One and Only God",
"virtues": "The personal name of the Creator—containing all attributes of majesty, beauty, power, and mercy. Knowing Allah transforms the believer into a complete servant of God. It fills the heart with love, fear, hope, trust, and devotion. The more a believer knows Allah’s names, the stronger and more peaceful the heart becomes.",
"practices": [
"Call upon Allah using all His names.",
"Strengthen Tawheed—avoid depending on creation.",
"Dedicate your entire life for Allah’s pleasure.",
"Purify intentions in all actions.",
"Love Allah above everything else."
]
},
{
"id": 99,
"name_ar": "ٱلرَّبُّ",
"name_bn": "Ar-Rabb",
"meaning_bn": "The Lord, The Nurturer",
"virtues": "Allah nurtures His creation with love, care, provision, knowledge, and guidance. He grows souls, hearts, and destinies step by step. Belief in Ar-Rabb creates trust and emotional security—Allah is taking care of you every moment. This name is deeply comforting for those who feel lost, unloved, or overwhelmed.",
"practices": [
"Speak to Allah daily—share your struggles and dreams.",
"Trust Allah’s plan during growth stages of life.",
"Be nurturing to your family, children, and community.",
"Treat yourself with care—Allah nurtures you, so don’t neglect yourself.",
"Thank Allah for every blessing—food, sleep, love, safety."
]
}
]
}
